yuhengli001/test_sensor/STM32_WPAN/App/vibration_service_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    Vibration_Service_app.c
  * @author  MCD Application Team
  * @brief   Vibration_Service_app application definition.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "log_module.h"
#include "app_ble.h"
#include "ll_sys_if.h"
#include "dbg_trace.h"
#include "vibration_service_app.h"
#include "vibration_service.h"
#include "stm32_rtos.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

typedef enum
{
  Vibration_data_NOTIFICATION_OFF,
  Vibration_data_NOTIFICATION_ON,
  Spectrum_array_NOTIFICATION_OFF,
  Spectrum_array_NOTIFICATION_ON,
  /* USER CODE BEGIN Service4_APP_SendInformation_t */

  /* USER CODE END Service4_APP_SendInformation_t */
  VIBRATION_SERVICE_APP_SENDINFORMATION_LAST
} VIBRATION_SERVICE_APP_SendInformation_t;

typedef struct
{
  VIBRATION_SERVICE_APP_SendInformation_t     Vibration_data_Notification_Status;
  VIBRATION_SERVICE_APP_SendInformation_t     Spectrum_array_Notification_Status;
  /* USER CODE BEGIN Service4_APP_Context_t */

  /* USER CODE END Service4_APP_Context_t */
  uint16_t              ConnectionHandle;
} VIBRATION_SERVICE_APP_Context_t;

/* Private defines -----------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* External variables --------------------------------------------------------*/
/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
static VIBRATION_SERVICE_APP_Context_t VIBRATION_SERVICE_APP_Context;

uint8_t a_VIBRATION_SERVICE_UpdateCharData[247];

/* USER CODE BEGIN PV */
static VIBRATION_Config_t Vibration_Config = {
    .preset                = 0,   /* HIGH_FREQUENCY */
    .measured_point        = 80,  /* 200 mm from sensor */
    .hwaas                 = 16,  /* balanced SNR vs. speed; increase to 32-64 for long range */
    .profile               = 3,   /* balanced pulse profile; increase to 4-5 for long range */
    .continuous_sweep_mode = 0,   /* OFF — matches HIGH_FREQUENCY preset default */
    .double_buffering      = 0,   /* OFF — matches HIGH_FREQUENCY preset default */
};
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void VIBRATION_SERVICE_Vibration_data_SendNotification(void);
static void VIBRATION_SERVICE_Spectrum_array_SendNotification(void);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void VIBRATION_SERVICE_Notification(VIBRATION_SERVICE_NotificationEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service4_Notification_1 */

  /* USER CODE END Service4_Notification_1 */
  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service4_Notification_Service4_EvtOpcode */

    /* USER CODE END Service4_Notification_Service4_EvtOpcode */

    case VIBRATION_SERVICE_VIBRATION_CONFIG_READ_EVT:
      /* USER CODE BEGIN Service4Char1_READ_EVT */

      /* USER CODE END Service4Char1_READ_EVT */
      break;

    case VIBRATION_SERVICE_VIBRATION_CONFIG_WRITE_EVT:
      /* USER CODE BEGIN Service4Char1_WRITE_EVT */
      if (p_Notification->DataTransfered.Length <= sizeof(VIBRATION_Config_t))
      {
          memcpy(&Vibration_Config, p_Notification->DataTransfered.p_Payload, p_Notification->DataTransfered.Length);
          LOG_INFO_APP("Vibration Config Updated via BLE\r\n");
      }
      /* USER CODE END Service4Char1_WRITE_EVT */
      break;

    case VIBRATION_SERVICE_VIBRATION_DATA_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN Service4Char2_NOTIFY_ENABLED_EVT */
      VIBRATION_SERVICE_APP_Context.Vibration_data_Notification_Status = Vibration_data_NOTIFICATION_ON;
      /* USER CODE END Service4Char2_NOTIFY_ENABLED_EVT */
      break;

    case VIBRATION_SERVICE_VIBRATION_DATA_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN Service4Char2_NOTIFY_DISABLED_EVT */
      VIBRATION_SERVICE_APP_Context.Vibration_data_Notification_Status = Vibration_data_NOTIFICATION_OFF;
      /* USER CODE END Service4Char2_NOTIFY_DISABLED_EVT */
      break;

    case VIBRATION_SERVICE_SPECTRUM_ARRAY_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN Service4Char3_NOTIFY_ENABLED_EVT */

      /* USER CODE END Service4Char3_NOTIFY_ENABLED_EVT */
      break;

    case VIBRATION_SERVICE_SPECTRUM_ARRAY_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN Service4Char3_NOTIFY_DISABLED_EVT */

      /* USER CODE END Service4Char3_NOTIFY_DISABLED_EVT */
      break;

    default:
      /* USER CODE BEGIN Service4_Notification_default */

      /* USER CODE END Service4_Notification_default */
      break;
  }
  /* USER CODE BEGIN Service4_Notification_2 */

  /* USER CODE END Service4_Notification_2 */
  return;
}

void VIBRATION_SERVICE_APP_EvtRx(VIBRATION_SERVICE_APP_ConnHandleNotEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service4_APP_EvtRx_1 */

  /* USER CODE END Service4_APP_EvtRx_1 */

  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service4_APP_EvtRx_Service4_EvtOpcode */

    /* USER CODE END Service4_APP_EvtRx_Service4_EvtOpcode */
    case VIBRATION_SERVICE_CONN_HANDLE_EVT :
      /* USER CODE BEGIN Service4_APP_CONN_HANDLE_EVT */

      /* USER CODE END Service4_APP_CONN_HANDLE_EVT */
      break;

    case VIBRATION_SERVICE_DISCON_HANDLE_EVT :
      /* USER CODE BEGIN Service4_APP_DISCON_HANDLE_EVT */

      /* USER CODE END Service4_APP_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN Service4_APP_EvtRx_default */

      /* USER CODE END Service4_APP_EvtRx_default */
      break;
  }

  /* USER CODE BEGIN Service4_APP_EvtRx_2 */

  /* USER CODE END Service4_APP_EvtRx_2 */

  return;
}

void VIBRATION_SERVICE_APP_Init(void)
{
  UNUSED(VIBRATION_SERVICE_APP_Context);
  VIBRATION_SERVICE_Init();

  /* USER CODE BEGIN Service4_APP_Init */

  /* USER CODE END Service4_APP_Init */
  return;
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
__USED void VIBRATION_SERVICE_Vibration_data_SendNotification(void) /* Property Notification */
{
  VIBRATION_SERVICE_APP_SendInformation_t notification_on_off = Vibration_data_NOTIFICATION_OFF;
  VIBRATION_SERVICE_Data_t vibration_service_notification_data;

  vibration_service_notification_data.p_Payload = (uint8_t*)a_VIBRATION_SERVICE_UpdateCharData;
  vibration_service_notification_data.Length = 0;

  /* USER CODE BEGIN Service4Char2_NS_1 */

  /* USER CODE END Service4Char2_NS_1 */

  if (notification_on_off != Vibration_data_NOTIFICATION_OFF)
  {
    VIBRATION_SERVICE_UpdateValue(VIBRATION_SERVICE_VIBRATION_DATA, &vibration_service_notification_data);
  }

  /* USER CODE BEGIN Service4Char2_NS_Last */

  /* USER CODE END Service4Char2_NS_Last */

  return;
}

__USED void VIBRATION_SERVICE_Spectrum_array_SendNotification(void) /* Property Notification */
{
  VIBRATION_SERVICE_APP_SendInformation_t notification_on_off = Spectrum_array_NOTIFICATION_OFF;
  VIBRATION_SERVICE_Data_t vibration_service_notification_data;

  vibration_service_notification_data.p_Payload = (uint8_t*)a_VIBRATION_SERVICE_UpdateCharData;
  vibration_service_notification_data.Length = 0;

  /* USER CODE BEGIN Service4Char3_NS_1 */

  /* USER CODE END Service4Char3_NS_1 */

  if (notification_on_off != Spectrum_array_NOTIFICATION_OFF)
  {
    VIBRATION_SERVICE_UpdateValue(VIBRATION_SERVICE_SPECTRUM_ARRAY, &vibration_service_notification_data);
  }

  /* USER CODE BEGIN Service4Char3_NS_Last */

  /* USER CODE END Service4Char3_NS_Last */

  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
void VIBRATION_APP_UpdateData(float freq, float displ, float freq2, float displ2)
{
    VIBRATION_Data_t data;

    /* --- Peak 1: derive all physics from freq + displacement --- */
    data.frequency        = freq;
    data.displacement     = displ;
    if (freq > 0.0f && displ > 0.0f) {
        float omega           = 2.0f * 3.14159265f * freq;
        float vel_peak        = (displ * omega) / 1e3f;   /* mm/s */
        float accel_peak      = (displ * omega * omega) / 1e6f; /* m/s^2 */
        data.displacement_rms = displ    / 1.41421356f;
        data.velocity         = vel_peak;
        data.velocity_rms     = vel_peak / 1.41421356f;
        data.acceleration     = accel_peak;
        data.acceleration_rms = accel_peak / 1.41421356f;
    } else {
        data.displacement_rms = 0.0f;
        data.velocity         = 0.0f;
        data.velocity_rms     = 0.0f;
        data.acceleration     = 0.0f;
        data.acceleration_rms = 0.0f;
    }

    /* --- Peak 2: just store freq + displacement --- */
    data.frequency2    = freq2;
    data.displacement2 = displ2;

    VIBRATION_SERVICE_Data_t ble_data;
    ble_data.p_Payload = (uint8_t*)&data;
    ble_data.Length    = sizeof(VIBRATION_Data_t);

    if (VIBRATION_SERVICE_APP_Context.Vibration_data_Notification_Status == Vibration_data_NOTIFICATION_ON)
    {
        VIBRATION_SERVICE_UpdateValue(VIBRATION_SERVICE_VIBRATION_DATA, &ble_data);
    }
}

VIBRATION_Config_t* VIBRATION_APP_GetConfig(void)
{
    return &Vibration_Config;
}
/* USER CODE END FD_LOCAL_FUNCTIONS */
